{
  "name": "Gas Town Documentation",
  "url": "https://docs.gt.villamarket.ai",
  "description": "Multi-agent orchestration for AI coding agents",
  "generated": "2026-02-13T17:19:50.585Z",
  "sections": [
    {
      "id": "getting-started",
      "title": "Getting Started",
      "pages": [
        {
          "title": "Getting Started",
          "path": "/docs/getting-started",
          "description": "This section covers everything you need to go from zero to running Gas Town with your first project."
        },
        {
          "title": "Installation",
          "path": "/docs/getting-started/installation",
          "description": "Install Gas Town via Homebrew, npm, or build from source, plus required dependencies like Beads and tmux."
        },
        {
          "title": "Quick Start",
          "path": "/docs/getting-started/quickstart",
          "description": "Set up your Gas Town workspace, add your first project, start the core agents, and give the Mayor your first instructions."
        },
        {
          "title": "Your First Convoy",
          "path": "/docs/getting-started/first-convoy",
          "description": "A Convoy is Gas Town's primary unit for tracking batches of related work. This walkthrough takes you through creating and monitoring your first convoy."
        }
      ]
    },
    {
      "id": "architecture",
      "title": "Architecture",
      "pages": [
        {
          "title": "Architecture",
          "path": "/docs/architecture",
          "description": "Gas Town's architecture draws from Erlang's supervisor trees and mailbox patterns — battle-tested approaches to building reliable distributed systems."
        },
        {
          "title": "System Overview",
          "path": "/docs/architecture/overview",
          "description": "Gas Town consists of five layers: the Town workspace, Rigs for each project, Agents that do the work, a Daemon scheduler, and a Communication layer connecting everything."
        },
        {
          "title": "Agent Hierarchy",
          "path": "/docs/architecture/agent-hierarchy",
          "description": "Gas Town uses a supervisor tree pattern inspired by Erlang/OTP. Each agent level monitors the level below it, providing fault tolerance and automatic recovery."
        },
        {
          "title": "Work Distribution",
          "path": "/docs/architecture/work-distribution",
          "description": "Every piece of work in Gas Town follows a defined lifecycle from creation to completion."
        },
        {
          "title": "Design Principles",
          "path": "/docs/architecture/design-principles",
          "description": "Gas Town is built on several core design principles that guide its architecture and behavior."
        }
      ]
    },
    {
      "id": "cli-reference",
      "title": "Cli Reference",
      "pages": [
        {
          "title": "CLI Reference",
          "path": "/docs/cli-reference",
          "description": "Complete reference for the gt CLI, covering workspace management, agents, work distribution, communication, and diagnostics commands."
        },
        {
          "title": "Workspace Management",
          "path": "/docs/cli-reference/workspace",
          "description": "CLI commands for installing, initializing, and managing your Gas Town workspace, including gt install, gt start, gt up, gt down, and gt shutdown."
        },
        {
          "title": "Agent Operations",
          "path": "/docs/cli-reference/agents",
          "description": "CLI commands for starting, stopping, monitoring, and managing the Gas Town agent hierarchy, including lifecycle and role management operations."
        },
        {
          "title": "Work Management",
          "path": "/docs/cli-reference/work",
          "description": "CLI commands for creating, assigning, tracking, and completing work items using gt for orchestration and bd (Beads) for issue tracking."
        },
        {
          "title": "Convoy & Tracking",
          "path": "/docs/cli-reference/convoys",
          "description": "CLI commands for creating, managing, and tracking convoys -- Gas Town's mechanism for bundling related beads and monitoring batch progress."
        },
        {
          "title": "Communication",
          "path": "/docs/cli-reference/communication",
          "description": "CLI commands for inter-agent messaging, notifications, escalations, and broadcasts using Gas Town's Erlang-inspired asynchronous mailbox system."
        },
        {
          "title": "gt nudge",
          "path": "/docs/cli-reference/nudge",
          "description": "Send synchronous messages directly to any worker's Claude Code session for real-time coordination between agents."
        },
        {
          "title": "gt sling",
          "path": "/docs/cli-reference/sling",
          "description": "Assign work to agents and rigs. The primary command for work distribution in Gas Town, handling polecat spawning, formula instantiation, and batch dispatch."
        },
        {
          "title": "Merge Queue",
          "path": "/docs/cli-reference/merge-queue",
          "description": "CLI commands for managing the Refinery's merge queue, including listing, inspecting, retrying, and resolving merge requests submitted by polecats."
        },
        {
          "title": "Rig Management",
          "path": "/docs/cli-reference/rigs",
          "description": "CLI commands for adding, configuring, starting, stopping, and managing rigs -- Gas Town's project containers that wrap git repositories."
        },
        {
          "title": "Session & Handoff",
          "path": "/docs/cli-reference/sessions",
          "description": "Commands for managing agent sessions, handoffs between sessions, molecules (multi-step workflows), and formulas (reusable workflow templates)."
        },
        {
          "title": "gt session",
          "path": "/docs/cli-reference/session-commands",
          "description": "Manage tmux sessions for polecats: start, stop, restart, attach, monitor health, and capture output."
        },
        {
          "title": "gt polecat",
          "path": "/docs/cli-reference/polecat-commands",
          "description": "Manage polecat lifecycle: list, inspect, nuke, garbage collect, detect stale workers, check recovery state, and manage identities."
        },
        {
          "title": "gt refinery",
          "path": "/docs/cli-reference/refinery-commands",
          "description": "Manage the Refinery, the per-rig merge queue processor that serializes all merges to main. Start, stop, monitor, and inspect merge requests."
        },
        {
          "title": "Diagnostics",
          "path": "/docs/cli-reference/diagnostics",
          "description": "CLI commands for monitoring, auditing, and troubleshooting Gas Town, with visibility into system health, agent activity, and resource usage."
        },
        {
          "title": "Configuration",
          "path": "/docs/cli-reference/configuration",
          "description": "CLI commands for configuring Gas Town agent runtimes, account settings, themes, hooks, and issue integration at the town and rig levels."
        },
        {
          "title": "gt formula",
          "path": "/docs/cli-reference/formula",
          "description": "Manage workflow formulas — reusable TOML/JSON templates that define multi-step molecules with variables and composition rules."
        },
        {
          "title": "gt dolt",
          "path": "/docs/cli-reference/dolt",
          "description": "Manage the Dolt SQL server that provides multi-client access to all rig bead databases."
        },
        {
          "title": "gt warrant",
          "path": "/docs/cli-reference/warrant",
          "description": "File and execute death warrants for stuck or unresponsive agents that need controlled termination."
        },
        {
          "title": "gt patrol",
          "path": "/docs/cli-reference/patrol",
          "description": "Manage patrol cycle digests — aggregate ephemeral per-cycle data into daily summaries."
        },
        {
          "title": "gt krc",
          "path": "/docs/cli-reference/krc",
          "description": "Key Record Chronicle — TTL-based lifecycle management for ephemeral operational data like patrol heartbeats and status checks."
        }
      ]
    },
    {
      "id": "agents",
      "title": "Agents",
      "pages": [
        {
          "title": "Agents",
          "path": "/docs/agents",
          "description": "Overview of Gas Town's agent hierarchy: Mayor, Deacon, Witness, Refinery, Polecats, Dogs, Crew, and Boot. Each role's scope, lifecycle, and responsibilities."
        },
        {
          "title": "Mayor -- Global Coordinator",
          "path": "/docs/agents/mayor",
          "description": "The Mayor is Gas Town's global coordinator. It receives human instructions, creates beads and convoys, assigns work to rigs, and tracks progress to completion."
        },
        {
          "title": "Deacon -- Town-Level Watchdog",
          "path": "/docs/agents/deacon",
          "description": "The Deacon is Gas Town's town-level watchdog agent. It monitors agent health, manages lifecycles, performs boot triage, and ensures self-healing operation."
        },
        {
          "title": "Witness -- Per-Rig Health Monitor",
          "path": "/docs/agents/witness",
          "description": "The Witness is a per-rig health monitor that watches polecats, detects problems before they spread, and keeps the workspace clean."
        },
        {
          "title": "Refinery -- Merge Queue Processor",
          "path": "/docs/agents/refinery",
          "description": "The Refinery is the merge queue processor that serializes merges from concurrent polecats, ensuring every change is rebased, validated, and cleanly integrated."
        },
        {
          "title": "Polecats -- Ephemeral Workers",
          "path": "/docs/agents/polecats",
          "description": "Polecats are Gas Town's ephemeral workers. They spawn, do their job, submit their work, and disappear. No idle time. No wasted resources."
        },
        {
          "title": "Dogs -- Infrastructure Workers",
          "path": "/docs/agents/dogs",
          "description": "Dogs are Gas Town's infrastructure workers. They clean up messes, sync systems, and handle cross-rig tasks that no single polecat or witness can manage alone."
        },
        {
          "title": "Crew -- Human Workspaces",
          "path": "/docs/agents/crew",
          "description": "Crew workspaces give human developers a persistent, fully integrated seat at the Gas Town table, always ready for hands-on work alongside AI agents."
        },
        {
          "title": "Boot -- Daemon Watchdog Dog",
          "path": "/docs/agents/boot",
          "description": "Boot is the daemon watchdog dog. It runs fresh on every daemon tick, takes a snapshot of the world, and decides whether the Deacon needs waking or nudging."
        }
      ]
    },
    {
      "id": "concepts",
      "title": "Concepts",
      "pages": [
        {
          "title": "Core Concepts",
          "path": "/docs/concepts",
          "description": "Core concepts behind Gas Town: beads, hooks, convoys, molecules, gates, rigs, the MEOW stack, GUPP principles, wisps, and session cycling."
        },
        {
          "title": "Beads (Issue Tracking)",
          "path": "/docs/concepts/beads",
          "description": "Beads is Gas Town's AI-native, git-backed issue tracking system. Issues live in your repository as structured data, managed entirely through the bd CLI."
        },
        {
          "title": "Hooks (Persistence)",
          "path": "/docs/concepts/hooks",
          "description": "Hooks are Gas Town's durability primitive -- persistent attachment points that store work state surviving crashes, restarts, handoffs, and compaction."
        },
        {
          "title": "Convoys (Batch Tracking)",
          "path": "/docs/concepts/convoys",
          "description": "Convoys bundle multiple beads into tracked batches, provide progress monitoring, auto-close on completion, and notify subscribers when work lands."
        },
        {
          "title": "Molecules & Formulas",
          "path": "/docs/concepts/molecules",
          "description": "Molecules are multi-step workflow instances created from TOML-defined formulas. They track step progress through crashes, handoffs, and context compaction."
        },
        {
          "title": "Gates (Async Coordination)",
          "path": "/docs/concepts/gates",
          "description": "Gates are synchronization points that park Gas Town workflows while waiting for external conditions like CI pipelines, human approvals, or timers."
        },
        {
          "title": "Rigs (Project Containers)",
          "path": "/docs/concepts/rigs",
          "description": "A Rig is Gas Town's project container, wrapping a git repository with agent infrastructure including a Witness, Refinery, Polecats, and Crew workspaces."
        },
        {
          "title": "The MEOW Stack",
          "path": "/docs/concepts/meow-stack",
          "description": "The MEOW Stack is Gas Town's layered abstraction model for organizing work, from atomic Beads to reusable Formulas."
        },
        {
          "title": "GUPP & NDI",
          "path": "/docs/concepts/gupp",
          "description": "The Gas Town Universal Propulsion Principle (GUPP) and Nondeterministic Idempotence (NDI) are the core design principles that make Gas Town reliable at scale."
        },
        {
          "title": "Wisps (Ephemeral Sub-Beads)",
          "path": "/docs/concepts/wisps",
          "description": "Wisps are lightweight, ephemeral sub-beads that track individual steps within a molecule. They provide granular progress visibility without cluttering the persistent issue database."
        },
        {
          "title": "Session Cycling",
          "path": "/docs/concepts/session-cycling",
          "description": "Session cycling is Gas Town's mechanism for refreshing an agent's context window without losing work. When an agent's context fills up, it hands off to a fresh session that resumes from where it left off."
        },
        {
          "title": "Patrol Cycles",
          "path": "/docs/concepts/patrol-cycles",
          "description": "Patrol cycles are the heartbeat of Gas Town's monitoring infrastructure. Persistent agents periodically observe system state and take corrective action — preferring discovery over tracking."
        }
      ]
    },
    {
      "id": "workflows",
      "title": "Workflows",
      "pages": [
        {
          "title": "Workflows",
          "path": "/docs/workflows",
          "description": "Gas Town supports several workflow patterns for getting work done. Choose the one that best matches your needs and infrastructure."
        },
        {
          "title": "Mayor Workflow (MEOW)",
          "path": "/docs/workflows/mayor-workflow",
          "description": "The MEOW workflow lets the Mayor handle bead creation, convoy management, agent assignment, and progress monitoring from natural language instructions."
        },
        {
          "title": "Minimal Mode (No Tmux)",
          "path": "/docs/workflows/minimal-mode",
          "description": "Minimal Mode lets you use Gas Town's hooks, beads, and convoy tracking without Tmux or the full agent hierarchy. Ideal for getting started."
        },
        {
          "title": "Manual Convoy Workflow",
          "path": "/docs/workflows/manual-convoy",
          "description": "The Manual Convoy Workflow gives you direct control over work distribution while using Gas Town's convoy tracking, merge queue, and agent infrastructure."
        },
        {
          "title": "Formula Workflow",
          "path": "/docs/workflows/formula-workflow",
          "description": "The Formula Workflow uses predefined TOML templates to orchestrate structured, repeatable processes like releases, design explorations, and audits."
        },
        {
          "title": "Code Review Workflow",
          "path": "/docs/workflows/code-review",
          "description": "Gas Town's parallel code review workflow spawns multiple specialized reviewer polecats to examine code from different perspectives and synthesize findings."
        },
        {
          "title": "Crew Collaboration",
          "path": "/docs/workflows/crew-collaboration",
          "description": "Patterns for humans working alongside AI agents in crew workspaces -- reviewing polecat output, feeding guzzoline, and maintaining code quality while the fleet runs."
        },
        {
          "title": "Handoff Ceremony",
          "path": "/docs/workflows/handoff-ceremony",
          "description": "The handoff ceremony is the protocol agents follow when cycling to a fresh session. It ensures work continuity across context boundaries by persisting state in hooks and communicating context through handoff mail."
        }
      ]
    },
    {
      "id": "operations",
      "title": "Operations",
      "pages": [
        {
          "title": "Operations",
          "path": "/docs/operations",
          "description": "Day-to-day Gas Town operations: starting and stopping the system, monitoring health, handling escalations, troubleshooting, and extending with plugins."
        },
        {
          "title": "Starting & Stopping",
          "path": "/docs/operations/lifecycle",
          "description": "How to start, pause, and shut down Gas Town agents and rigs. Covers gt start, gt up, gt down, and gt shutdown with their key differences."
        },
        {
          "title": "Monitoring & Health",
          "path": "/docs/operations/monitoring",
          "description": "Gas Town monitoring tools for real-time activity feeds, historical audits, system health diagnostics, and cost tracking across your agent fleet."
        },
        {
          "title": "Escalation System",
          "path": "/docs/operations/escalations",
          "description": "Gas Town's escalation system routes priority alerts upward through the agent supervision hierarchy, ensuring critical issues reach the human operator quickly."
        },
        {
          "title": "Troubleshooting",
          "path": "/docs/operations/troubleshooting",
          "description": "Diagnose and resolve common Gas Town problems. Covers gt doctor diagnostics, agent issues, merge queue failures, and recovery procedures."
        },
        {
          "title": "Plugins",
          "path": "/docs/operations/plugins",
          "description": "Extend Gas Town with custom plugins for automation, gates, and scheduled tasks. Plugins can operate at town level or be scoped to individual rigs."
        }
      ]
    },
    {
      "id": "guides",
      "title": "Guides",
      "pages": [
        {
          "title": "Guides",
          "path": "/docs/guides",
          "description": "In-depth guides for using Gas Town effectively: usage patterns, architecture, cost management, multi-runtime support, and design philosophy."
        },
        {
          "title": "Usage Guide",
          "path": "/docs/guides/usage-guide",
          "description": "Practical day-to-day Gas Town usage patterns: entry points, the three developer loops, working with Mayor and Crew, the PR Sheriff pattern, 5 tips for effective use, and the mandatory landing checklist."
        },
        {
          "title": "The 8 Stages of AI Coding",
          "path": "/docs/guides/eight-stages",
          "description": "The 8-stage maturity framework for AI-assisted development, from zero AI to multi-agent orchestration. Gas Town targets Stage 7 and above."
        },
        {
          "title": "Multi-Runtime Support",
          "path": "/docs/guides/multi-runtime",
          "description": "Gas Town supports multiple AI agent runtimes including Claude Code, Gemini CLI, Codex, Cursor, Auggie, and Amp. Learn how to configure and mix runtimes."
        },
        {
          "title": "Cost Management",
          "path": "/docs/guides/cost-management",
          "description": "Guide to monitoring, understanding, and optimizing Gas Town token costs. Covers cost breakdowns by agent type and strategies to reduce spend."
        },
        {
          "title": "Background & Philosophy",
          "path": "/docs/guides/philosophy",
          "description": "Gas Town is not just a tool -- it is a thesis about the future of software development. This guide covers why Gas Town exists, how it evolved, the intellectual foundations behind its design, and the community response to its ideas."
        },
        {
          "title": "Architecture Guide",
          "path": "/docs/guides/architecture",
          "description": "A comprehensive tour of Gas Town's architecture: how Mayor, Deacon, Witness, Refinery, and Polecats work together as a self-healing multi-agent system built on Erlang-inspired supervision, git worktrees, and persistent hooks."
        },
        {
          "title": "Troubleshooting",
          "path": "/docs/guides/troubleshooting",
          "description": "Solutions for the most common Gas Town problems: gt done failures, polecat churn, branch naming, bead routing, hook conflicts, and stuck refineries."
        },
        {
          "title": "Glossary",
          "path": "/docs/guides/glossary",
          "description": "Complete terminology reference for Gas Town, covering all agents, concepts, commands, and conventions."
        }
      ]
    }
  ],
  "pages": [
    {
      "title": "Boot -- Daemon Watchdog Dog",
      "path": "/docs/agents/boot",
      "section": "agents",
      "description": "Boot is the daemon watchdog dog. It runs fresh on every daemon tick, takes a snapshot of the world, and decides whether the Deacon needs waking or nudging."
    },
    {
      "title": "Crew -- Human Workspaces",
      "path": "/docs/agents/crew",
      "section": "agents",
      "description": "Crew workspaces give human developers a persistent, fully integrated seat at the Gas Town table, always ready for hands-on work alongside AI agents."
    },
    {
      "title": "Deacon -- Town-Level Watchdog",
      "path": "/docs/agents/deacon",
      "section": "agents",
      "description": "The Deacon is Gas Town's town-level watchdog agent. It monitors agent health, manages lifecycles, performs boot triage, and ensures self-healing operation."
    },
    {
      "title": "Dogs -- Infrastructure Workers",
      "path": "/docs/agents/dogs",
      "section": "agents",
      "description": "Dogs are Gas Town's infrastructure workers. They clean up messes, sync systems, and handle cross-rig tasks that no single polecat or witness can manage alone."
    },
    {
      "title": "Agents",
      "path": "/docs/agents",
      "section": "agents",
      "description": "Overview of Gas Town's agent hierarchy: Mayor, Deacon, Witness, Refinery, Polecats, Dogs, Crew, and Boot. Each role's scope, lifecycle, and responsibilities."
    },
    {
      "title": "Mayor -- Global Coordinator",
      "path": "/docs/agents/mayor",
      "section": "agents",
      "description": "The Mayor is Gas Town's global coordinator. It receives human instructions, creates beads and convoys, assigns work to rigs, and tracks progress to completion."
    },
    {
      "title": "Polecats -- Ephemeral Workers",
      "path": "/docs/agents/polecats",
      "section": "agents",
      "description": "Polecats are Gas Town's ephemeral workers. They spawn, do their job, submit their work, and disappear. No idle time. No wasted resources."
    },
    {
      "title": "Refinery -- Merge Queue Processor",
      "path": "/docs/agents/refinery",
      "section": "agents",
      "description": "The Refinery is the merge queue processor that serializes merges from concurrent polecats, ensuring every change is rebased, validated, and cleanly integrated."
    },
    {
      "title": "Witness -- Per-Rig Health Monitor",
      "path": "/docs/agents/witness",
      "section": "agents",
      "description": "The Witness is a per-rig health monitor that watches polecats, detects problems before they spread, and keeps the workspace clean."
    },
    {
      "title": "Agent Hierarchy",
      "path": "/docs/architecture/agent-hierarchy",
      "section": "architecture",
      "description": "Gas Town uses a supervisor tree pattern inspired by Erlang/OTP. Each agent level monitors the level below it, providing fault tolerance and automatic recovery."
    },
    {
      "title": "Design Principles",
      "path": "/docs/architecture/design-principles",
      "section": "architecture",
      "description": "Gas Town is built on several core design principles that guide its architecture and behavior."
    },
    {
      "title": "Architecture",
      "path": "/docs/architecture",
      "section": "architecture",
      "description": "Gas Town's architecture draws from Erlang's supervisor trees and mailbox patterns — battle-tested approaches to building reliable distributed systems."
    },
    {
      "title": "System Overview",
      "path": "/docs/architecture/overview",
      "section": "architecture",
      "description": "Gas Town consists of five layers: the Town workspace, Rigs for each project, Agents that do the work, a Daemon scheduler, and a Communication layer connecting everything."
    },
    {
      "title": "Work Distribution",
      "path": "/docs/architecture/work-distribution",
      "section": "architecture",
      "description": "Every piece of work in Gas Town follows a defined lifecycle from creation to completion."
    },
    {
      "title": "Agent Operations",
      "path": "/docs/cli-reference/agents",
      "section": "cli-reference",
      "description": "CLI commands for starting, stopping, monitoring, and managing the Gas Town agent hierarchy, including lifecycle and role management operations."
    },
    {
      "title": "Communication",
      "path": "/docs/cli-reference/communication",
      "section": "cli-reference",
      "description": "CLI commands for inter-agent messaging, notifications, escalations, and broadcasts using Gas Town's Erlang-inspired asynchronous mailbox system."
    },
    {
      "title": "Configuration",
      "path": "/docs/cli-reference/configuration",
      "section": "cli-reference",
      "description": "CLI commands for configuring Gas Town agent runtimes, account settings, themes, hooks, and issue integration at the town and rig levels."
    },
    {
      "title": "Convoy & Tracking",
      "path": "/docs/cli-reference/convoys",
      "section": "cli-reference",
      "description": "CLI commands for creating, managing, and tracking convoys -- Gas Town's mechanism for bundling related beads and monitoring batch progress."
    },
    {
      "title": "Diagnostics",
      "path": "/docs/cli-reference/diagnostics",
      "section": "cli-reference",
      "description": "CLI commands for monitoring, auditing, and troubleshooting Gas Town, with visibility into system health, agent activity, and resource usage."
    },
    {
      "title": "gt dolt",
      "path": "/docs/cli-reference/dolt",
      "section": "cli-reference",
      "description": "Manage the Dolt SQL server that provides multi-client access to all rig bead databases."
    },
    {
      "title": "gt formula",
      "path": "/docs/cli-reference/formula",
      "section": "cli-reference",
      "description": "Manage workflow formulas — reusable TOML/JSON templates that define multi-step molecules with variables and composition rules."
    },
    {
      "title": "CLI Reference",
      "path": "/docs/cli-reference",
      "section": "cli-reference",
      "description": "Complete reference for the gt CLI, covering workspace management, agents, work distribution, communication, and diagnostics commands."
    },
    {
      "title": "gt krc",
      "path": "/docs/cli-reference/krc",
      "section": "cli-reference",
      "description": "Key Record Chronicle — TTL-based lifecycle management for ephemeral operational data like patrol heartbeats and status checks."
    },
    {
      "title": "Merge Queue",
      "path": "/docs/cli-reference/merge-queue",
      "section": "cli-reference",
      "description": "CLI commands for managing the Refinery's merge queue, including listing, inspecting, retrying, and resolving merge requests submitted by polecats."
    },
    {
      "title": "gt nudge",
      "path": "/docs/cli-reference/nudge",
      "section": "cli-reference",
      "description": "Send synchronous messages directly to any worker's Claude Code session for real-time coordination between agents."
    },
    {
      "title": "gt patrol",
      "path": "/docs/cli-reference/patrol",
      "section": "cli-reference",
      "description": "Manage patrol cycle digests — aggregate ephemeral per-cycle data into daily summaries."
    },
    {
      "title": "gt polecat",
      "path": "/docs/cli-reference/polecat-commands",
      "section": "cli-reference",
      "description": "Manage polecat lifecycle: list, inspect, nuke, garbage collect, detect stale workers, check recovery state, and manage identities."
    },
    {
      "title": "gt refinery",
      "path": "/docs/cli-reference/refinery-commands",
      "section": "cli-reference",
      "description": "Manage the Refinery, the per-rig merge queue processor that serializes all merges to main. Start, stop, monitor, and inspect merge requests."
    },
    {
      "title": "Rig Management",
      "path": "/docs/cli-reference/rigs",
      "section": "cli-reference",
      "description": "CLI commands for adding, configuring, starting, stopping, and managing rigs -- Gas Town's project containers that wrap git repositories."
    },
    {
      "title": "gt session",
      "path": "/docs/cli-reference/session-commands",
      "section": "cli-reference",
      "description": "Manage tmux sessions for polecats: start, stop, restart, attach, monitor health, and capture output."
    },
    {
      "title": "Session & Handoff",
      "path": "/docs/cli-reference/sessions",
      "section": "cli-reference",
      "description": "Commands for managing agent sessions, handoffs between sessions, molecules (multi-step workflows), and formulas (reusable workflow templates)."
    },
    {
      "title": "gt sling",
      "path": "/docs/cli-reference/sling",
      "section": "cli-reference",
      "description": "Assign work to agents and rigs. The primary command for work distribution in Gas Town, handling polecat spawning, formula instantiation, and batch dispatch."
    },
    {
      "title": "gt warrant",
      "path": "/docs/cli-reference/warrant",
      "section": "cli-reference",
      "description": "File and execute death warrants for stuck or unresponsive agents that need controlled termination."
    },
    {
      "title": "Work Management",
      "path": "/docs/cli-reference/work",
      "section": "cli-reference",
      "description": "CLI commands for creating, assigning, tracking, and completing work items using gt for orchestration and bd (Beads) for issue tracking."
    },
    {
      "title": "Workspace Management",
      "path": "/docs/cli-reference/workspace",
      "section": "cli-reference",
      "description": "CLI commands for installing, initializing, and managing your Gas Town workspace, including gt install, gt start, gt up, gt down, and gt shutdown."
    },
    {
      "title": "Beads (Issue Tracking)",
      "path": "/docs/concepts/beads",
      "section": "concepts",
      "description": "Beads is Gas Town's AI-native, git-backed issue tracking system. Issues live in your repository as structured data, managed entirely through the bd CLI."
    },
    {
      "title": "Convoys (Batch Tracking)",
      "path": "/docs/concepts/convoys",
      "section": "concepts",
      "description": "Convoys bundle multiple beads into tracked batches, provide progress monitoring, auto-close on completion, and notify subscribers when work lands."
    },
    {
      "title": "Gates (Async Coordination)",
      "path": "/docs/concepts/gates",
      "section": "concepts",
      "description": "Gates are synchronization points that park Gas Town workflows while waiting for external conditions like CI pipelines, human approvals, or timers."
    },
    {
      "title": "GUPP & NDI",
      "path": "/docs/concepts/gupp",
      "section": "concepts",
      "description": "The Gas Town Universal Propulsion Principle (GUPP) and Nondeterministic Idempotence (NDI) are the core design principles that make Gas Town reliable at scale."
    },
    {
      "title": "Hooks (Persistence)",
      "path": "/docs/concepts/hooks",
      "section": "concepts",
      "description": "Hooks are Gas Town's durability primitive -- persistent attachment points that store work state surviving crashes, restarts, handoffs, and compaction."
    },
    {
      "title": "Core Concepts",
      "path": "/docs/concepts",
      "section": "concepts",
      "description": "Core concepts behind Gas Town: beads, hooks, convoys, molecules, gates, rigs, the MEOW stack, GUPP principles, wisps, and session cycling."
    },
    {
      "title": "The MEOW Stack",
      "path": "/docs/concepts/meow-stack",
      "section": "concepts",
      "description": "The MEOW Stack is Gas Town's layered abstraction model for organizing work, from atomic Beads to reusable Formulas."
    },
    {
      "title": "Molecules & Formulas",
      "path": "/docs/concepts/molecules",
      "section": "concepts",
      "description": "Molecules are multi-step workflow instances created from TOML-defined formulas. They track step progress through crashes, handoffs, and context compaction."
    },
    {
      "title": "Patrol Cycles",
      "path": "/docs/concepts/patrol-cycles",
      "section": "concepts",
      "description": "Patrol cycles are the heartbeat of Gas Town's monitoring infrastructure. Persistent agents periodically observe system state and take corrective action — preferring discovery over tracking."
    },
    {
      "title": "Rigs (Project Containers)",
      "path": "/docs/concepts/rigs",
      "section": "concepts",
      "description": "A Rig is Gas Town's project container, wrapping a git repository with agent infrastructure including a Witness, Refinery, Polecats, and Crew workspaces."
    },
    {
      "title": "Session Cycling",
      "path": "/docs/concepts/session-cycling",
      "section": "concepts",
      "description": "Session cycling is Gas Town's mechanism for refreshing an agent's context window without losing work. When an agent's context fills up, it hands off to a fresh session that resumes from where it left off."
    },
    {
      "title": "Wisps (Ephemeral Sub-Beads)",
      "path": "/docs/concepts/wisps",
      "section": "concepts",
      "description": "Wisps are lightweight, ephemeral sub-beads that track individual steps within a molecule. They provide granular progress visibility without cluttering the persistent issue database."
    },
    {
      "title": "Your First Convoy",
      "path": "/docs/getting-started/first-convoy",
      "section": "getting-started",
      "description": "A Convoy is Gas Town's primary unit for tracking batches of related work. This walkthrough takes you through creating and monitoring your first convoy."
    },
    {
      "title": "Getting Started",
      "path": "/docs/getting-started",
      "section": "getting-started",
      "description": "This section covers everything you need to go from zero to running Gas Town with your first project."
    },
    {
      "title": "Installation",
      "path": "/docs/getting-started/installation",
      "section": "getting-started",
      "description": "Install Gas Town via Homebrew, npm, or build from source, plus required dependencies like Beads and tmux."
    },
    {
      "title": "Quick Start",
      "path": "/docs/getting-started/quickstart",
      "section": "getting-started",
      "description": "Set up your Gas Town workspace, add your first project, start the core agents, and give the Mayor your first instructions."
    },
    {
      "title": "Architecture Guide",
      "path": "/docs/guides/architecture",
      "section": "guides",
      "description": "A comprehensive tour of Gas Town's architecture: how Mayor, Deacon, Witness, Refinery, and Polecats work together as a self-healing multi-agent system built on Erlang-inspired supervision, git worktrees, and persistent hooks."
    },
    {
      "title": "Cost Management",
      "path": "/docs/guides/cost-management",
      "section": "guides",
      "description": "Guide to monitoring, understanding, and optimizing Gas Town token costs. Covers cost breakdowns by agent type and strategies to reduce spend."
    },
    {
      "title": "The 8 Stages of AI Coding",
      "path": "/docs/guides/eight-stages",
      "section": "guides",
      "description": "The 8-stage maturity framework for AI-assisted development, from zero AI to multi-agent orchestration. Gas Town targets Stage 7 and above."
    },
    {
      "title": "Glossary",
      "path": "/docs/guides/glossary",
      "section": "guides",
      "description": "Complete terminology reference for Gas Town, covering all agents, concepts, commands, and conventions."
    },
    {
      "title": "Guides",
      "path": "/docs/guides",
      "section": "guides",
      "description": "In-depth guides for using Gas Town effectively: usage patterns, architecture, cost management, multi-runtime support, and design philosophy."
    },
    {
      "title": "Multi-Runtime Support",
      "path": "/docs/guides/multi-runtime",
      "section": "guides",
      "description": "Gas Town supports multiple AI agent runtimes including Claude Code, Gemini CLI, Codex, Cursor, Auggie, and Amp. Learn how to configure and mix runtimes."
    },
    {
      "title": "Background & Philosophy",
      "path": "/docs/guides/philosophy",
      "section": "guides",
      "description": "Gas Town is not just a tool -- it is a thesis about the future of software development. This guide covers why Gas Town exists, how it evolved, the intellectual foundations behind its design, and the community response to its ideas."
    },
    {
      "title": "Troubleshooting",
      "path": "/docs/guides/troubleshooting",
      "section": "guides",
      "description": "Solutions for the most common Gas Town problems: gt done failures, polecat churn, branch naming, bead routing, hook conflicts, and stuck refineries."
    },
    {
      "title": "Usage Guide",
      "path": "/docs/guides/usage-guide",
      "section": "guides",
      "description": "Practical day-to-day Gas Town usage patterns: entry points, the three developer loops, working with Mayor and Crew, the PR Sheriff pattern, 5 tips for effective use, and the mandatory landing checklist."
    },
    {
      "title": "Gas Town Documentation",
      "path": "/docs/index",
      "section": "root",
      "description": "Gas Town is a multi-agent orchestration system that coordinates fleets of AI coding agents, scaling from one to 30 concurrent workers via the gt CLI."
    },
    {
      "title": "Escalation System",
      "path": "/docs/operations/escalations",
      "section": "operations",
      "description": "Gas Town's escalation system routes priority alerts upward through the agent supervision hierarchy, ensuring critical issues reach the human operator quickly."
    },
    {
      "title": "Operations",
      "path": "/docs/operations",
      "section": "operations",
      "description": "Day-to-day Gas Town operations: starting and stopping the system, monitoring health, handling escalations, troubleshooting, and extending with plugins."
    },
    {
      "title": "Starting & Stopping",
      "path": "/docs/operations/lifecycle",
      "section": "operations",
      "description": "How to start, pause, and shut down Gas Town agents and rigs. Covers gt start, gt up, gt down, and gt shutdown with their key differences."
    },
    {
      "title": "Monitoring & Health",
      "path": "/docs/operations/monitoring",
      "section": "operations",
      "description": "Gas Town monitoring tools for real-time activity feeds, historical audits, system health diagnostics, and cost tracking across your agent fleet."
    },
    {
      "title": "Plugins",
      "path": "/docs/operations/plugins",
      "section": "operations",
      "description": "Extend Gas Town with custom plugins for automation, gates, and scheduled tasks. Plugins can operate at town level or be scoped to individual rigs."
    },
    {
      "title": "Troubleshooting",
      "path": "/docs/operations/troubleshooting",
      "section": "operations",
      "description": "Diagnose and resolve common Gas Town problems. Covers gt doctor diagnostics, agent issues, merge queue failures, and recovery procedures."
    },
    {
      "title": "Code Review Workflow",
      "path": "/docs/workflows/code-review",
      "section": "workflows",
      "description": "Gas Town's parallel code review workflow spawns multiple specialized reviewer polecats to examine code from different perspectives and synthesize findings."
    },
    {
      "title": "Crew Collaboration",
      "path": "/docs/workflows/crew-collaboration",
      "section": "workflows",
      "description": "Patterns for humans working alongside AI agents in crew workspaces -- reviewing polecat output, feeding guzzoline, and maintaining code quality while the fleet runs."
    },
    {
      "title": "Formula Workflow",
      "path": "/docs/workflows/formula-workflow",
      "section": "workflows",
      "description": "The Formula Workflow uses predefined TOML templates to orchestrate structured, repeatable processes like releases, design explorations, and audits."
    },
    {
      "title": "Handoff Ceremony",
      "path": "/docs/workflows/handoff-ceremony",
      "section": "workflows",
      "description": "The handoff ceremony is the protocol agents follow when cycling to a fresh session. It ensures work continuity across context boundaries by persisting state in hooks and communicating context through handoff mail."
    },
    {
      "title": "Workflows",
      "path": "/docs/workflows",
      "section": "workflows",
      "description": "Gas Town supports several workflow patterns for getting work done. Choose the one that best matches your needs and infrastructure."
    },
    {
      "title": "Manual Convoy Workflow",
      "path": "/docs/workflows/manual-convoy",
      "section": "workflows",
      "description": "The Manual Convoy Workflow gives you direct control over work distribution while using Gas Town's convoy tracking, merge queue, and agent infrastructure."
    },
    {
      "title": "Mayor Workflow (MEOW)",
      "path": "/docs/workflows/mayor-workflow",
      "section": "workflows",
      "description": "The MEOW workflow lets the Mayor handle bead creation, convoy management, agent assignment, and progress monitoring from natural language instructions."
    },
    {
      "title": "Minimal Mode (No Tmux)",
      "path": "/docs/workflows/minimal-mode",
      "section": "workflows",
      "description": "Minimal Mode lets you use Gas Town's hooks, beads, and convoy tracking without Tmux or the full agent hierarchy. Ideal for getting started."
    }
  ]
}